from aiogram import Router, F
from aiogram.filters import CommandStart, Command
from aiogram.types import Message

from keyboards.common import main_menu_keyboard


router = Router()


@router.message(CommandStart())
async def cmd_start(message: Message):
    """
    /start — приветствие и показ главного меню.
    """
    await message.answer(
        "👋Добро пожаловать! Я - ваш быстрый помощник по домашним делам.\n"
        "Здесь вы за 5 минут найдете проверенного специалиста для ремонта: \n"
        "сантехника, электрика, мастера по ремонту техники и других. \n"
        "Также вы можете добавить себя как мастера.",
        reply_markup=main_menu_keyboard(),
    )

'''
👋Добро пожаловать! Я - ваш быстрый помощник по домашним делам.
Здесь вы за 5 минут найдете проверенного специалиста для ремонта: сантехника, электрика, мастера по ремонту техники и других.
Также вы можете добавить себя как мастера
'''

@router.message(Command("menu"))
async def cmd_menu(message: Message):
    """
    /menu — показать главное меню.
    """
    await message.answer(
        "Главное меню:", reply_markup=main_menu_keyboard()
    )
